### Ordinal Number Encoding

In [1]:
import datetime

In [5]:
today_date = datetime.datetime.today()
today_date

datetime.datetime(2023, 4, 15, 23, 29, 29, 522340)

In [6]:
today_date-datetime.timedelta(1)

datetime.datetime(2023, 4, 14, 23, 29, 29, 522340)

In [28]:
#### List comprehension
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [29]:
import pandas as pd
data = pd.DataFrame(days)
data.columns = ["Day"]
data.head()

                         Day
0 2023-04-15 23:29:29.522340
1 2023-04-14 23:29:29.522340
2 2023-04-13 23:29:29.522340
3 2023-04-12 23:29:29.522340
4 2023-04-11 23:29:29.522340

In [30]:
data["Weekday"] = data["Day"].dt.day_name()

data["Weekday"]

0      Saturday
1        Friday
2      Thursday
3     Wednesday
4       Tuesday
5        Monday
6        Sunday
7      Saturday
8        Friday
9      Thursday
10    Wednesday
11      Tuesday
12       Monday
13       Sunday
14     Saturday
Name: Weekday, dtype: object

In [31]:
data.head()

                         Day    Weekday
0 2023-04-15 23:29:29.522340   Saturday
1 2023-04-14 23:29:29.522340     Friday
2 2023-04-13 23:29:29.522340   Thursday
3 2023-04-12 23:29:29.522340  Wednesday
4 2023-04-11 23:29:29.522340    Tuesday

In [32]:
dictonary = {"Monday" : 1, "Tuesday" :2, "Wednesday" : 3,"Thursday":4,"Friday":5,"Saturday":6, "Sunday":7}

In [35]:
data["Weekday_Ordinal"] = data["Weekday"].map(dictonary)
data["Weekday_Ordinal"]

0     6
1     5
2     4
3     3
4     2
5     1
6     7
7     6
8     5
9     4
10    3
11    2
12    1
13    7
14    6
Name: Weekday_Ordinal, dtype: int64

In [36]:
data.head()

                         Day    Weekday  Weekday_Ordinal
0 2023-04-15 23:29:29.522340   Saturday                6
1 2023-04-14 23:29:29.522340     Friday                5
2 2023-04-13 23:29:29.522340   Thursday                4
3 2023-04-12 23:29:29.522340  Wednesday                3
4 2023-04-11 23:29:29.522340    Tuesday                2

### Count or Frequency Encoding

In [1]:
import pandas as pd
df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data", header = None,index_col=None )
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [2]:
columns = [1,3,5,6,7,8,9,13]

In [3]:
train_set = df[columns]

In [4]:
train_set.columns = ["Employment","Degree","Status","Designation","Family_job","Race","Sex","Country"]

In [5]:
train_set.head()

,Employment,Degree,Status,Designation,Family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [6]:
for feature in train_set.columns:
    print(feature, ":",len(train_set[feature].unique()),"labels")

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [10]:
country_map = train_set.Country.value_counts().to_dict()
country_map

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Laos': 18,
 ' Thailand': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [16]:
train_set['Country'] = train_set['Country'].map(country_map)

C:\Users\Pravas\AppData\Local\Temp/ipykernel_9004/3809746398.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_set['Country'] = train_set['Country'].map(country_map)

In [17]:
train_set.head()

,Employment,Degree,Status,Designation,Family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantages
1. Easy to use
2. Not Increasing feature space

#### Disadvantages
1. It will provide same weight if the frequency is same.

### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0.

In [41]:
df = pd.read_csv("titanic.csv", usecols=["Cabin","Survived"])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [42]:
df['Cabin'].fillna("Missing", inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [52]:
df["Cabin"] = df["Cabin"].astype(str).str[0]

In [53]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [54]:
df.groupby("Cabin")["Survived"].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [55]:
df.groupby("Cabin")["Survived"].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [59]:
ordinal_labels = df.groupby("Cabin")["Survived"].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [61]:
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [62]:
df["Cabin_ordinal_labels"] = df['Cabin'].map(ordinal_labels2)

In [63]:
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

#### Mean Encoding

In [66]:
mean_ordinal = df.groupby("Cabin")["Survived"].mean().to_dict()
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [67]:
df["mean_ordinal_encoding"] = df["Cabin"].map(mean_ordinal)

In [68]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encoding
0         0     M                     1               0.299854
1         1     C                     4               0.593220
2         1     M                     1               0.299854
3         1     C                     4               0.593220
4         0     M                     1               0.299854